//  Домашнее задание:
//
//  1. Создайте три класса Человек, Кот, Робот. Эти классы должны уметь бегать и прыгать
//     (методы просто выводят информацию о действии в консоль). Подумайте, что вам сможет помочь не дублировать код и
//     унифицировать эти классы для дальнейшей работы с ими?
//  2. Создайте два класса: беговая дорожка и стена, при прохождении через которые, участники должны выполнять
//     соответствующие действия (бежать или прыгать), результат выполнения печатаем в консоль
//     (успешно пробежал, не смог пробежать и т.д.).
//  3. Создайте два массива: с участниками и препятствиями, и заставьте всех участников пройти этот набор препятствий.
//  4. У препятствий есть длина (для дорожки) или высота (для стены), а у участников ограничения на бег и прыжки.
//     Если участник не смог пройти одно из препятствий, то дальше по списку он препятствий не идет.

package ru.geekbrains.java_core_level2;

public class Main {

    public static void main(String[] args) {

//        Homework 2.1

    }
}
